epd09/p1/build/web/WEB-INF/wsdl/localhost_8080/ej1/GeneradorPassword.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is Metro/2.3.2-b608 (trunk-7979; 2015-01-21T12:50:19+0000) JAXWS-RI/2.2.11-b150120.1832 JAXWS-API/2.2.12 JAXB-RI/2.2.12-b141219.1637 JAXB-API/2.2.13-b141020.1521 svn-revision#unknown. --><!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is Metro/2.3.2-b608 (trunk-7979; 2015-01-21T12:50:19+0000) JAXWS-RI/2.2.11-b150120.1832 JAXWS-API/2.2.12 JAXB-RI/2.2.12-b141219.1637 JAXB-API/2.2.13-b141020.1521 svn-revision#unknown. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://webService/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://webService/" name="GeneradorPassword">
<types>
<xsd:schema>
<xsd:import namespace="http://webService/" schemaLocation="http://localhost:8080/ej1/GeneradorPassword?xsd=1"/>
</xsd:schema>
</types>
<message name="generatorPass">
<part name="parameters" element="tns:generatorPass"/>
</message>
<message name="generatorPassResponse">
<part name="parameters" element="tns:generatorPassResponse"/>
</message>
<portType name="GeneradorPassword">
<operation name="generatorPass">
<input wsam:Action="http://webService/GeneradorPassword/generatorPassRequest" message="tns:generatorPass"/>
<output wsam:Action="http://webService/GeneradorPassword/generatorPassResponse" message="tns:generatorPassResponse"/>
</operation>
</portType>
<binding name="GeneradorPasswordPortBinding" type="tns:GeneradorPassword">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="generatorPass">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
</binding>
<service name="GeneradorPassword">
<port name="GeneradorPasswordPort" binding="tns:GeneradorPasswordPortBinding">
<soap:address location="http://localhost:8080/ej1/GeneradorPassword"/>
</port>
</service>
</definitions>