epd_08/p1/web/index.html

<!DOCTYPE html>
<!--
To change this license header, choose License Headers in Project Properties.
To change this template file, choose Tools | Templates
and open the template in the editor.
-->
<html>
    <head>
        <title>TODO supply a title</title>
        <meta charset="UTF-8">
        <meta name="viewport" content="width=device-width, initial-scale=1.0">
        <script type="text/javascript">

            var xhttp = new HMLHttpRequest();
            var l = 10;
            xhttp.open("POST", "http://localhost:8080/ej1/GeneradorPassword", false);

            var request = '<?xml version="1.0" encoding="UTF-8"?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">'
                    + '<SOAP-ENV:Header/>'
                    + '<S:Body>'
                    + '<ns2:generatorPass xmlns:ns2="http://webService/">'
                    + '<pass>' + l + '</pass>'
                    + '</ns2:generatorPass>'
                    + '</S:Body>'
                    + '</S:Envelope>';
            xhttp.setRequestHeader("Content-Type", "text/xml");
            xhttp.send(request);
            document.write("El resultado es el siguiente: " + xhttp.responseText);

        </script>
    </head>
    <body>

    </body>
</html>
